Autodesk.Revit.DB.SlabShapeVertex.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SlabShapeVertex.Position
The vertex position

Autodesk.Revit.DB.SlabShapeVertex.VertexType
The vertex type

Autodesk.Revit.DB.SlabShapeVertex.#ctor(Autodesk.Revit.DB.SlabShapeEditor,System.Int32)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.SlabShapeVertex
Represents a vertex of a slab shape edited element.